{"weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv2d/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_10/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_10/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_11/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_11/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_12/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_12/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_13/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_13/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_14/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_14/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_15/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_15/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_16/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_16/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "conv2d_17/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_17/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "conv2d_18/kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_19/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_19/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_20/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_20/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_21/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_21/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_22/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_22/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_23/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_23/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_24/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_24/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_25/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_25/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_26/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_26/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_27/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_28/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_28/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_29/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_29/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_30/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_30/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_31/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_31/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_32/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_32/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_33/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_33/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_34/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_34/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_35/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_35/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_36/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_36/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_37/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_37/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_38/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_38/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_39/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_39/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_40/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_40/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_41/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_41/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_42/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_42/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv2d_43/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_43/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_44/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_44/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 2], "name": "conv2d_45/kernel"}, {"dtype": "float32", "shape": [2], "name": "conv2d_45/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 2], "name": "conv2d_46/kernel"}, {"dtype": "float32", "shape": [2], "name": "conv2d_46/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 6], "name": "conv2d_47/kernel"}, {"dtype": "float32", "shape": [6], "name": "conv2d_47/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 36], "name": "conv2d_48/kernel"}, {"dtype": "float32", "shape": [36], "name": "conv2d_48/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 36], "name": "conv2d_49/kernel"}, {"dtype": "float32", "shape": [36], "name": "conv2d_49/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_5/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 108], "name": "conv2d_50/kernel"}, {"dtype": "float32", "shape": [108], "name": "conv2d_50/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_6/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 32], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_7/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_8/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_9/kernel"}, {"dtype": "float32", "shape": [2, 2, 256, 256], "name": "conv2d_transpose/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_transpose/bias"}, {"dtype": "float32", "shape": [2, 2, 128, 256], "name": "conv2d_transpose_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_transpose_1/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_1/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_1/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_10/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_10/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_11/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_11/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_12/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_12/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_13/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_13/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_14/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_14/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_15/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_15/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_16/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_16/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_17/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_17/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_18/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_18/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_19/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_19/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_2/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_2/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_20/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_20/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_21/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_21/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_22/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_22/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_23/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_23/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_24/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_24/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_25/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_25/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_26/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_26/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_27/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_27/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_28/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_28/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_29/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_29/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_3/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_3/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_30/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_30/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_31/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_31/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_32/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_32/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_33/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_33/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_34/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_34/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_35/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_35/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_36/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_36/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_37/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_37/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_38/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_38/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "depthwise_conv2d_39/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "depthwise_conv2d_39/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_4/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_4/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_40/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_40/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_5/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_5/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_6/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_6/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_7/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_7/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_8/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_8/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "depthwise_conv2d_9/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "depthwise_conv2d_9/bias"}]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "name": "input", "sparse": false}, "name": "input"}, {"class_name": "Conv2D", "inbound_nodes": [[["input", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d"}, {"class_name": "ReLU", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"name": "re_lu", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_1"}, {"class_name": "Add", "inbound_nodes": [[["re_lu", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add"}, "name": "add"}, {"class_name": "ReLU", "inbound_nodes": [[["add", 0, 0, {}]]], "config": {"name": "re_lu_1", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_1"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_2"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_1", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "name": "add_1"}, {"class_name": "ReLU", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "re_lu_2", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_2"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_3"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_2", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "name": "add_2"}, {"class_name": "ReLU", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "re_lu_3", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_3"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_3", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_4"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "name": "add_3"}, {"class_name": "ReLU", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "re_lu_4", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_4"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_4", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_5"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_4", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_4"}, "name": "add_4"}, {"class_name": "ReLU", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "re_lu_5", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_5"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_5", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_6"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_5", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_5"}, "name": "add_5"}, {"class_name": "ReLU", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "re_lu_6", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_6"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_6", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_7"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_6", 0, 0, {}], ["conv2d_7", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_6"}, "name": "add_6"}, {"class_name": "ReLU", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "re_lu_7", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_7"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["re_lu_7", 0, 0, {}]]], "config": {"name": "max_pooling2d", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_7", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_7", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_8"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_7"}, "name": "add_7"}, {"class_name": "ReLU", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "re_lu_8", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_8"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_8", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_10"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_8", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_8"}, "name": "add_8"}, {"class_name": "ReLU", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "re_lu_9", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_9"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_9", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_9", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_11"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_9", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_9"}, "name": "add_9"}, {"class_name": "ReLU", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "re_lu_10", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_10"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_10", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_10", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_12"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_10", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_10"}, "name": "add_10"}, {"class_name": "ReLU", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"name": "re_lu_11", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_11"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_11", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_11", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_13"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_11", 0, 0, {}], ["conv2d_13", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_11"}, "name": "add_11"}, {"class_name": "ReLU", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"name": "re_lu_12", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_12"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_12", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_12", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_12", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_14"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_12", 0, 0, {}], ["conv2d_14", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_12"}, "name": "add_12"}, {"class_name": "ReLU", "inbound_nodes": [[["add_12", 0, 0, {}]]], "config": {"name": "re_lu_13", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_13"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_13", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_13", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_15"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_13", 0, 0, {}], ["conv2d_15", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_13"}, "name": "add_13"}, {"class_name": "ReLU", "inbound_nodes": [[["add_13", 0, 0, {}]]], "config": {"name": "re_lu_14", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_14"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_14", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_14", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_16"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_14", 0, 0, {}], ["conv2d_16", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_14"}, "name": "add_14"}, {"class_name": "ReLU", "inbound_nodes": [[["add_14", 0, 0, {}]]], "config": {"name": "re_lu_15", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_15"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["re_lu_15", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "same", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_15", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_15", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_17"}, {"class_name": "Add", "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["conv2d_17", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_15"}, "name": "add_15"}, {"class_name": "ReLU", "inbound_nodes": [[["add_15", 0, 0, {}]]], "config": {"name": "re_lu_16", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_16"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_16", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_16", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_16"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_16", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_19"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_16", 0, 0, {}], ["conv2d_19", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_16"}, "name": "add_16"}, {"class_name": "ReLU", "inbound_nodes": [[["add_16", 0, 0, {}]]], "config": {"name": "re_lu_17", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_17"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_17", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_17", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_20"}, {"class_name": "Add", "inbound_nodes": [[["re_lu_17", 0, 0, {}], ["conv2d_20", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_17"}, "name": "add_17"}, {"class_name": "ReLU", "inbound_nodes": [[["add_17", 0, 0, {}]]], "config": {"name": "re_lu_18", "dtype": "float32", "trainable": true, "max_value": null, "threshold": 0.0, "negative_slope": 0.0}, "name": "re_lu_18"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["re_lu_18", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_18", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": 