{"weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 16], "name": "conv2d/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_1/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_10/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_10/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_100/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_100/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_101/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_101/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_102/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_102/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_103/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_103/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_104/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_104/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_105/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_105/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_106/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_106/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 128], "name": "conv2d_107/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_107/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_108/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_108/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_109/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_109/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_11/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_11/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_110/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_110/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_111/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_111/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_112/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_112/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_113/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_113/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_114/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_114/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_115/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_115/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_116/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_116/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_117/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_117/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_118/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_118/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_119/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_119/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_12/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_12/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_120/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_120/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_121/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_121/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_122/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_122/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_123/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_123/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_124/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_124/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 1], "name": "conv2d_125/kernel"}, {"dtype": "float32", "shape": [1], "name": "conv2d_125/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 42], "name": "conv2d_126/kernel"}, {"dtype": "float32", "shape": [42], "name": "conv2d_126/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_13/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_13/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_14/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_14/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_15/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_15/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_16/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_16/bias"}, {"dtype": "float32", "shape": [2, 2, 16, 16], "name": "conv2d_17/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_17/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_18/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_18/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_19/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_19/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_2/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_20/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_20/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_21/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_21/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_22/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_22/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_23/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_23/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_24/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_24/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_25/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_25/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_26/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_26/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_27/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_27/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_28/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_28/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_29/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_29/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_3/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_30/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_30/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_31/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_31/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_32/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_32/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "conv2d_33/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_33/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 32], "name": "conv2d_34/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_34/bias"}, {"dtype": "float32", "shape": [2, 2, 32, 32], "name": "conv2d_35/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_35/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_36/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_36/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_37/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_37/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_38/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_38/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_39/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_39/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_4/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_40/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_40/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_41/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_41/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_42/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_42/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_43/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_43/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_44/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_44/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_45/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_45/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_46/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_46/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_47/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_47/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_48/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_48/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_49/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_49/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_5/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_50/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_50/bias"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "name": "conv2d_51/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_51/bias"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv2d_52/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_52/bias"}, {"dtype": "float32", "shape": [2, 2, 64, 128], "name": "conv2d_53/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_53/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_54/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_54/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_55/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_55/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_56/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_56/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_57/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_57/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_58/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_58/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_59/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_59/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_6/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_60/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_60/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_61/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_61/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_62/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_62/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_63/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_63/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_64/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_64/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_65/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_65/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_66/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_66/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_67/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_67/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_68/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_68/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_69/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_69/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_7/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_70/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_70/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 128], "name": "conv2d_71/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_71/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_72/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_72/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_73/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_73/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_74/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_74/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_75/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_75/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_76/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_76/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_77/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_77/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_78/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_78/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_79/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_79/bias"}, {"dtype": "float32", "shape": [1, 1, 8, 16], "name": "conv2d_8/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_8/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_80/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_80/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_81/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_81/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_82/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_82/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_83/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_83/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_84/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_84/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_85/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_85/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_86/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_86/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_87/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_87/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_88/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_88/bias"}, {"dtype": "float32", "shape": [2, 2, 256, 128], "name": "conv2d_89/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_89/bias"}, {"dtype": "float32", "shape": [1, 1, 16, 8], "name": "conv2d_9/kernel"}, {"dtype": "float32", "shape": [8], "name": "conv2d_9/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_90/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_90/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_91/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_91/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_92/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_92/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_93/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_93/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_94/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_94/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_95/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_95/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_96/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_96/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_97/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_97/bias"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv2d_98/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv2d_98/bias"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "conv2d_99/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_99/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d_1/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d_1/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_10/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_10/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_11/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_11/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_12/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_12/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_13/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_13/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_14/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_14/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_15/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_15/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_16/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_16/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_17/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_17/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_18/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_18/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_19/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_19/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d_2/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d_2/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_20/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_20/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_21/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_21/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_22/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_22/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_23/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_23/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_24/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_24/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "depthwise_conv2d_25/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "depthwise_conv2d_25/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_26/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_26/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_27/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_27/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_28/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_28/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_29/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_29/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d_3/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d_3/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_30/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_30/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_31/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_31/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_32/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_32/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_33/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_33/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_34/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_34/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_35/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_35/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_36/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_36/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_37/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_37/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_38/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_38/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_39/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_39/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d_4/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d_4/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_40/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_40/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_41/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_41/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_42/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_42/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_43/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_43/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_44/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_44/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_45/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_45/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_46/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_46/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_47/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_47/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_48/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_48/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_49/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_49/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d_5/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d_5/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_50/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_50/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_51/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_51/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_52/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_52/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_53/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_53/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_54/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_54/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_55/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_55/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_56/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_56/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_57/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_57/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_58/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_58/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_59/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_59/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d_6/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d_6/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_60/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_60/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "depthwise_conv2d_61/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "depthwise_conv2d_61/bias"}, {"dtype": "float32", "shape": [3, 3, 8, 1], "name": "depthwise_conv2d_7/depthwise_kernel"}, {"dtype": "float32", "shape": [8], "name": "depthwise_conv2d_7/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_8/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_8/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 1], "name": "depthwise_conv2d_9/depthwise_kernel"}, {"dtype": "float32", "shape": [16], "name": "depthwise_conv2d_9/bias"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_1/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_10/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_100/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_101/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_102/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_103/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_104/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_105/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_106/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_107/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_108/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_109/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_11/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_110/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_111/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_112/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_113/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_114/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_115/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_116/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_117/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_118/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_119/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_12/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_120/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_121/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_122/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_123/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_124/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_13/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_14/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_15/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_16/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_17/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_18/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_19/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_2/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_20/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_21/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_22/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_23/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_24/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_25/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_26/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_27/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_28/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_29/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_3/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_30/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_31/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_32/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_33/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_34/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_35/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_36/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_37/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_38/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_39/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_4/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_40/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_41/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_42/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_43/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_44/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_45/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_46/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_47/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_48/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_49/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_5/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_50/alpha"}, {"dtype": "float32", "shape": [1, 1, 32], "name": "p_re_lu_51/alpha"}, {"dtype": "float32", "shape": [1, 1, 64], "name": "p_re_lu_52/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_53/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_54/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_55/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_56/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_57/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_58/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_59/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_6/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_60/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_61/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_62/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_63/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_64/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_65/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_66/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_67/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_68/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_69/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_7/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_70/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_71/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_72/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_73/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_74/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_75/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_76/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_77/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_78/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_79/alpha"}, {"dtype": "float32", "shape": [1, 1, 16], "name": "p_re_lu_8/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_80/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_81/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_82/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_83/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_84/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_85/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_86/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_87/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_88/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_89/alpha"}, {"dtype": "float32", "shape": [1, 1, 8], "name": "p_re_lu_9/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_90/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_91/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_92/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_93/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_94/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_95/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_96/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_97/alpha"}, {"dtype": "float32", "shape": [1, 1, 256], "name": "p_re_lu_98/alpha"}, {"dtype": "float32", "shape": [1, 1, 128], "name": "p_re_lu_99/alpha"}]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d"}, {"class_name": "PReLU", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"name": "p_re_lu", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_1"}, {"class_name": "PReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "p_re_lu_1", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_1"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_2"}, {"class_name": "Add", "inbound_nodes": [[["p_re_lu", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add"}, "name": "add"}, {"class_name": "PReLU", "inbound_nodes": [[["add", 0, 0, {}]]], "config": {"name": "p_re_lu_2", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_3"}, {"class_name": "PReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "p_re_lu_3", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_3"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_4"}, {"class_name": "Add", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "name": "add_1"}, {"class_name": "PReLU", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "p_re_lu_4", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_5"}, {"class_name": "PReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "p_re_lu_5", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_5"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_6"}, {"class_name": "Add", "inbound_nodes": [[["p_re_lu_4", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "name": "add_2"}, {"class_name": "PReLU", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "p_re_lu_6", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_7"}, {"class_name": "PReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "p_re_lu_7", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_7"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "depthwise_conv2d_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "depthwise_conv2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["depthwise_conv2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_8"}, {"class_name": "Add", "inbound_nodes": [[["p_re_lu_6", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "name": "add_3"}, {"class_name": "PReLU", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "p_re_lu_8", "dtype": "float32", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "shared_axes": [1, 2]}, "name": "p_re_lu_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, 